# DATAFRAME SOCIAL - Limpieza

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sidetable as stb

### Una vez explorado nuestro DataFrame, con las columnas ya seleccionadas, hacemos la limpieza de datos oportuna.

In [158]:
df_social = pd.read_csv('../Datos/df-social-sucio.csv', index_col=0)

In [159]:
df_social.head()

,genero,edad,pais,nivel de estudios,puesto de trabajo,sector,tamaño de la compañia
0,Man,50-54,Indonesia,Master’s degree,Program/Project Manager,Manufacturing/Fabrication,"1000-9,999 employees"
1,Man,22-24,Pakistan,Master’s degree,Software Engineer,Academics/Education,"1000-9,999 employees"
2,Man,45-49,Mexico,Doctoral degree,Research Scientist,Academics/Education,"1000-9,999 employees"
3,Man,45-49,India,Doctoral degree,Other,Academics/Education,50-249 employees
4,Woman,25-29,India,I prefer not to answer,Currently not employed,NaN,NaN

### Creamos una nueva columna con los continentes usando "apply()".

In [160]:
continente1 = ['India', 'Turkey','Viet Nam', 'Bangladesh', 'Indonesia', 
        'Singapore', 'Taiwan', 'Hong Kong (S.A.R.)', 'Israel', 'Pakistan', 'Philippines', 'United Arab Emirates', 'Thailand', 'Japan', 'China', 'South Korea', 
       'Saudi Arabia', 'Malaysia', 'Kazakhstan', 'Nepal']

continente2 = ['Iran, Islamic Republic of...', 'Egypt','Morocco','Tunisia','Nigeria','Kenya','South Africa',
       'Algeria','Ghana','Uganda', 'Ethiopia', 'Iraq']

continente3 = ['Poland','Russia', 'Italy', 'Sweden',
       'Ireland', 'United Kingdom of Great Britain and Northern Ireland','Spain',
       'Germany', 'Belgium', 'Austria',
       'France', 'Romania', 'Ukraine', 
       'Netherlands', 'Portugal', 'Norway',
       'Czech Republic', 'Greece', 'Switzerland',
       'Denmark','Belarus']

continente4 = ['United States of America','Canada']

continente5 = ['Brazil', 'Argentina','Colombia', 'Mexico', 'Peru', 'Ecuador','Chile']

continente6 = ['Australia']

In [161]:
def continente(pais):
    if pais in continente1:
        return "Asia"
    elif pais in continente2:
        return "África"
    elif pais in continente3:
        return "Europa"
    elif pais in continente4:
        return "América del Norte"
    elif pais in continente5:
        return "América del Sur"
    elif pais in continente6:
        return "Oceanía"
    else: return "Other"

In [162]:
df_social["continente"] = df_social["pais"].apply(continente)

In [163]:
df_social.head()

,genero,edad,pais,nivel de estudios,puesto de trabajo,sector,tamaño de la compañia,continente
0,Man,50-54,Indonesia,Master’s degree,Program/Project Manager,Manufacturing/Fabrication,"1000-9,999 employees",Asia
1,Man,22-24,Pakistan,Master’s degree,Software Engineer,Academics/Education,"1000-9,999 employees",Asia
2,Man,45-49,Mexico,Doctoral degree,Research Scientist,Academics/Education,"1000-9,999 employees",América del Sur
3,Man,45-49,India,Doctoral degree,Other,Academics/Education,50-249 employees,Asia
4,Woman,25-29,India,I prefer not to answer,Currently not employed,NaN,NaN,Asia

In [164]:
df_social['continente'].unique()

array(['Asia', 'América del Sur', 'Europa', 'Oceanía', 'África',
       'América del Norte', 'Other'], dtype=object)

### Eliminamos la categoría "Other" puesto que no nos da información relevante para nuestro análisis:

In [165]:
df_social = df_social[df_social['continente'] != "Other"]

In [166]:
df_social['continente'].unique()

array(['Asia', 'América del Sur', 'Europa', 'Oceanía', 'África',
       'América del Norte'], dtype=object)

In [167]:
df_social.stb.missing()

                       missing  total    percent
tamaño de la compañia     9235  24527  37.652383
sector                    9164  24527  37.362906
genero                       0  24527   0.000000
edad                         0  24527   0.000000
pais                         0  24527   0.000000
nivel de estudios            0  24527   0.000000
puesto de trabajo            0  24527   0.000000
continente                   0  24527   0.000000

### Creamos otra columna, para identificar la rama del puesto de trabajo tecnológico en la que se encuentran:

In [168]:
df_social['puesto de trabajo'].unique()

array(['Program/Project Manager', 'Software Engineer',
       'Research Scientist', 'Other', 'Currently not employed', 'Student',
       'Data Scientist', 'Data Analyst', 'Machine Learning Engineer',
       'Data Engineer', 'Business Analyst', 'Product Manager',
       'Statistician', 'Developer Relations/Advocacy',
       'DBA/Database Engineer'], dtype=object)

In [169]:
data = ['Research Scientist','Data Scientist', 'Data Analyst', 'Machine Learning Engineer',
       'Business Analyst', 'Data Engineer','DBA/Database Engineer']

developer =  ['Software Engineer']

other = ['Program/Project Manager', 'Other', 'Currently not employed', 'Student',
       'Statistician', 'Developer Relations/Advocacy']

In [170]:
def puesto_sector(puesto):
    if puesto in data:
        return "data"
    elif puesto in developer:
        return "developer"
    elif puesto in other:
        return "other"
    else: return "other"

In [171]:
df_social["rama"] = df_social["puesto de trabajo"].apply(puesto_sector)

In [180]:
df_social.stb.missing()

                       missing  total   percent
tamaño de la compañia      778  13677  5.688382
sector                     712  13677  5.205820
genero                       0  13677  0.000000
edad                         0  13677  0.000000
pais                         0  13677  0.000000
nivel de estudios            0  13677  0.000000
puesto de trabajo            0  13677  0.000000
continente                   0  13677  0.000000
rama                         0  13677  0.000000

### Pasamos todos los elementos vacíos de la columna sector a nulos, para poder convertirlos en la moda.

In [172]:
def nulos(x):
    if x == "":
        return np.nan
    else:
        return x

In [173]:
df_social['sector'] = df_social['sector'].apply(nulos)

In [181]:
df_social['sector'].fillna(df_social['sector'].mode()[0], inplace=True)

In [182]:
df_social.stb.missing()

                       missing  total   percent
tamaño de la compañia      778  13677  5.688382
genero                       0  13677  0.000000
edad                         0  13677  0.000000
pais                         0  13677  0.000000
nivel de estudios            0  13677  0.000000
puesto de trabajo            0  13677  0.000000
sector                       0  13677  0.000000
continente                   0  13677  0.000000
rama                         0  13677  0.000000

### Hacemos lo mismo con la columna del tamaño de la compañía:

In [183]:
df_social['tamaño de la compañia'].fillna(df_social['tamaño de la compañia'].mode()[0], inplace=True)

In [184]:
df_social.stb.missing()

                       missing  total  percent
genero                       0  13677      0.0
edad                         0  13677      0.0
pais                         0  13677      0.0
nivel de estudios            0  13677      0.0
puesto de trabajo            0  13677      0.0
sector                       0  13677      0.0
tamaño de la compañia        0  13677      0.0
continente                   0  13677      0.0
rama                         0  13677      0.0

### Filtramos los datos para no incluir a los estudiantes ni desempleados en nuestro dataframe.

In [174]:
df_social = df_social[(df_social['puesto de trabajo'] != "Student") & (df_social['puesto de trabajo'] != "Other") & (df_social['puesto de trabajo'] != "Currently not employed")]
df_social.head()

,genero,edad,pais,nivel de estudios,puesto de trabajo,sector,tamaño de la compañia,continente,rama
0,Man,50-54,Indonesia,Master’s degree,Program/Project Manager,Manufacturing/Fabrication,"1000-9,999 employees",Asia,other
1,Man,22-24,Pakistan,Master’s degree,Software Engineer,Academics/Education,"1000-9,999 employees",Asia,developer
2,Man,45-49,Mexico,Doctoral degree,Research Scientist,Academics/Education,"1000-9,999 employees",América del Sur,data
6,Man,30-34,India,Bachelor’s degree,Data Scientist,Computers/Technology,"10,000 or more employees",Asia,data
12,Man,45-49,Nigeria,Master’s degree,Program/Project Manager,Shipping/Transportation,"1000-9,999 employees",África,other

In [175]:
df_social['puesto de trabajo'].unique()

array(['Program/Project Manager', 'Software Engineer',
       'Research Scientist', 'Data Scientist', 'Data Analyst',
       'Machine Learning Engineer', 'Data Engineer', 'Business Analyst',
       'Product Manager', 'Statistician', 'Developer Relations/Advocacy',
       'DBA/Database Engineer'], dtype=object)

### Filtramos los datos para no incluir cualquier sexo que no sea hombre o mujer.

In [176]:
df_social = df_social[(df_social["genero"]== "Man") | (df_social["genero"]=="Woman")]

In [177]:
df_social['genero'].unique()

array(['Man', 'Woman'], dtype=object)

In [178]:
df_social.head(10)

,genero,edad,pais,nivel de estudios,puesto de trabajo,sector,tamaño de la compañia,continente,rama
0,Man,50-54,Indonesia,Master’s degree,Program/Project Manager,Manufacturing/Fabrication,"1000-9,999 employees",Asia,other
1,Man,22-24,Pakistan,Master’s degree,Software Engineer,Academics/Education,"1000-9,999 employees",Asia,developer
2,Man,45-49,Mexico,Doctoral degree,Research Scientist,Academics/Education,"1000-9,999 employees",América del Sur,data
6,Man,30-34,India,Bachelor’s degree,Data Scientist,Computers/Technology,"10,000 or more employees",Asia,data
12,Man,45-49,Nigeria,Master’s degree,Program/Project Manager,Shipping/Transportation,"1000-9,999 employees",África,other
14,Man,35-39,Greece,Doctoral degree,Research Scientist,Academics/Education,50-249 employees,Europa,data
15,Man,50-54,Belgium,Bachelor’s degree,Data Analyst,Energy/Mining,"1000-9,999 employees",Europa,data
16,Man,18-21,Pakistan,Bachelor’s degree,Data Scientist,Academics/Education,0-49 employees,Asia,data
17,Man,22-24,Japan,Master’s degree,Software Engineer,NaN,NaN,Asia,developer
20,Woman,25-29,Turkey,Bachelor’s degree,Data Scientist,Computers/Technology,"10,000 or more employees",Asia,data

### Guardamos el resultado:

In [179]:
df_social.to_csv('../Datos/df-social-limpio.csv')